DeviceProcessEvents
| where FileName in ("appcmd.exe")
| extend CmdLine = tostring(ProcessCommandLine)
| where CmdLine has " list "
| where CmdLine has_any ("apppool","config")
| where CmdLine has_any ("processmodel.password","processmodel.username","/section:applicationpools") or CmdLine contains "password" or CmdLine contains "username"
| project Timestamp = TimeGenerated, DeviceName, InitiatingProcessAccountName,
          InitiatingProcessFileName, CmdLine, FileName, ProcessId
| order by Timestamp desc
